#Вход
#Броят на дните, в които тече кампанията – цяло число;
#Броят на сладкарите – цяло число;
#Броят на тортите – цяло число;
#Броят на гофретите – цяло число;
#Броят на палачинките – цяло число.

#изчисления
#брой торти направени от сладкар за ден = Броят на тортите / Броят на сладкарите
#брой гофрети направени от сладкар за ден = Броят на гофретите / Броят на сладкарите
#брой палачинки направени от сладкар за ден = Броят на палачинките / Броят на сладкарите
#Торта - 45 лв.
#Гофрета - 5.80 лв.
#Палачинка – 3.20 лв.
#цена общ брой торти на ден = брой торти направени от сладкар за ден * броят на сладкарите * 45 лв.
#цена общ брой гофрети на ден = брой гофрети направени от сладкар за ден * броят на сладкарите * 5.80лв.
#цена общ брой палачинки на ден = брой палачинки направени от сладкар за ден * броят на сладкарите * 3.20 лв.


campaign_days = int(input())
chefs = int(input())
cakes = int(input())
waffles = int(input())
pancakes = int(input())

cakes_per_day = cakes * 45
waffles_per_day = waffles * 5.8
pancakes_per_day = pancakes * 3.2

total_sum_per_day = (cakes_per_day + waffles_per_day + pancakes_per_day) * chefs
total_campaign_sum = total_sum_per_day * campaign_days
total_sum_after_expenses = total_campaign_sum - 0.125 * total_campaign_sum
print(total_sum_after_expenses)