#От конзолата се четат 3 реда:
#1.	Брой страници в текущата книга – цяло число;
#2.	Страници, които може да прочита за 1 час – цяло число;
#3.	Броя на дните, за които трябва да прочете книгата – цяло число;

#1. изчисляваме общото време за четене на книгата: 212 / 20 = 10.6 часа
#2. получения резултат делим на броя дни, за да получим необходимите часове на ден: 10.6 часа / 2 дни = 5.3 часа на ден

pages = int(input())
pages_per_hour = int(input())
deys = int(input())
book_time = pages / pages_per_hour
hours_per_day = book_time / deys
print(hours_per_day)